cf/Catalogs/ИсточникиДанныхУО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИсточникиДанныхУО</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МетаИсточник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетРасшифровка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтчетыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗапроса</Name>
					<Comment>Если параметры идут списком тогда будет повторятся несколько раз "Имя"</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>51</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ИсточникиДанныхУО/Ext/ManagerModule.bsl
Функция ПолучитьРезультат(Ссылка, ДатаНач = Неопределено, ДатаКон = Неопределено) Экспорт
	
	Если Ссылка.ЭтоГруппа Тогда
		
		// Получим сумму всех элементов
		
		Результат = 0;
		
		Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.ИсточникиДанныхУО ГДЕ Родитель = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат = Результат + Справочники.ИсточникиДанныхУО.ПолучитьРезультат(Выборка.Ссылка, ДатаНач, ДатаКон); КонецЦикла;
		
		Возврат Результат;
		
	Иначе
	
		Если ПустаяСтрока(Ссылка.ТекстЗапроса) Тогда
			ОбщиеФункции.СообщитьТекст(строка(Ссылка) + " не заполнен запрос!");
			ВОзврат Неопределено; КонецЕсли;
		
		// Установим пользовательские параметры запроса
		
		Запрос = Новый Запрос(Ссылка.ТекстЗапроса);
		УстановленныеПараметры = Новый Соответствие;
		
		Для Каждого Строка Из Ссылка.ПараметрыЗапроса Цикл
			Если УстановленныеПараметры[Строка.Имя] <> Истина Тогда
			
				Строки = Ссылка.ПараметрыЗапроса.НайтиСтроки(Новый Структура("Имя", Строка.Имя));
				Если Строки.Количество() > 1 Тогда 	// Это список параметров
					Список = Новый СписокЗначений;
					Для КАждого СтрокаСписка Из Строки Цикл Список.Добавить(СтрокаСписка.Значение) КонецЦикла; 
					Запрос.УстановитьПараметр(Строка.Имя, Список); 
				Иначе									// Это обычный параметр
					Запрос.УстановитьПараметр(Строка.Имя, Строка.Значение) КонецЕсли; КонецЕсли; КонецЦикла;
		
		// Установим предопределенные параметры запроса
		
		Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНач);
		Запрос.УстановитьПараметр("ДатаОкончания", 	?(ЗначениеЗаполнено(ДатаКон), ДатаКон, ТекущаяДата()));
		
		// Выполним
		
		Попытка
			Таблица = Запрос.Выполнить().Выгрузить();
		Исключение
			стрОшибки = ОписаниеОшибки();
			ОбщиеФункции.СообщитьТекст(Строка(Ссылка) + " ошибка выполнения запроса
														|" + стрОшибки); 
			Возврат Неопределено; КонецПопытки;
		
		Если Таблица.Колонки.Найти("Результат") = Неопределено Тогда
			ОбщиеФункции.СообщитьТекст(Строка(Ссылка) + " в запросе нет результирующей колонки ""Результат""");
			Возврат Неопределено КонецЕсли;
			
		Возврат Таблица.Итог("Результат"); КонецЕсли;
	
КонецФункции
